---
kind: other
id: Methods.T:Autodesk.Revit.DB.ScheduleFilter
source: html/cfccb134-0f2e-76c9-4450-29caa7917352.htm
---
# ScheduleFilter Methods

Gets the filter value for a filter using a double value.